[
  {
    "title": "COMP 3000 Seminar: The Real World  (1 Credit)",
    "description": "\nSeries of lectures by alumni and others on surviving culture shock when leaving the University and entering the job world.  Open to all students regardless of major. Cross listed with MATH 3000.\n"
  },
  {
    "title": "COMP 3372 Advanced Algorithms  (4 Credits)",
    "description": "\nAdvanced techniques for the design and analysis of algorithms and data structures; amortized complexity, self-adjusting data structures; randomized , online, and string algorithms; NP-completeness, approximation and exact exponential algorithms; flow networks.\n"
  },
  {
    "title": "COMP 3441 Introduction to Probability and Statistics for Data Science  (4 Credits)",
    "description": "\nThe course introduces fundamentals of probability for data science. Students survey data visualization methods and summary statistics, develop models for data, and apply statistical techniques to assess the validity of the models. The techniques will include parametric and nonparametric methods for parameter estimation and hypothesis testing for a single sample mean and two sample means, for proportions, and for simple linear regression. Students will acquire sound theoretical footing for the methods where practical, and will apply them to real-world data, primarily using R.\n"
  },
  {
    "title": "COMP 3455 Shell Scripting and System Tools  (4 Credits)",
    "description": "\nThis course covers navigating and utilizing tools in a UNIX environment, including use of common command line utilities, Bash and Python shell scripting, source control via Git, pipes and I/O redirection, networking in Python and OS multi-processing/multi-threading. More emphasis will be placed on using these tools than on how those tools work. Students should have experience with Python prior to taking this course.\n"
  },
  {
    "title": "COMP 3681 Networking for Games  (4 Credits)",
    "description": "\nImplementing the networking code for multiplayer games is a complex task that requires an understanding of performance, security, game design, and advanced programming concepts. In this course, students are introduced to the networking stack and how this is connected to the Internet, learn how to write protocols for games, and implement several large games using a game engine that demonstrate the kind of networking and protocols required by different genres of games. In addition, tools are introduced that help understand and debug networking code, simplify the creation of protocols, and make the development of networking code easier.\n"
  },
  {
    "title": "COMP 3701 Topics in Computer Graphics  (4 Credits)",
    "description": "\n"
  },
  {
    "title": "COMP 3702 Topics in Database  (4 Credits)",
    "description": "\n"
  },
  {
    "title": "COMP 3703 Topics-Artificial Intelligence  (4 Credits)",
    "description": "\n"
  },
  {
    "title": "COMP 3704 Advanced Topics: Systems  (4 Credits)",
    "description": "\n"
  },
  {
    "title": "COMP 3705 Topics in Computer Science  (1-4 Credits)",
    "description": "\n"
  },
  {
    "title": "COMP 3732 Human-Centered Data Security and Privacy  (4 Credits)",
    "description": "\nWith an increasing digital presence, it is critical to understand users' needs and requirements in using technological equipment to secure interactions and adhere to privacy perceptions. Thus, it is essential to analyze the cognitive, social, organizational, commercial, and cultural factors in mind. This course will provide a socio-technical approach for analyzing critical user interaction with devices encountered in everyday life, including web, mobiles, and wearables. This course will help students develop an understanding of technological interactions from the perspectives of multiple stakeholders such as users, developers, system administrators, and others and build tools to protect user data.\n"
  },
  {
    "title": "COMP 3991 Independent Study  (1-10 Credits)",
    "description": "\nCannot be arranged for any course that appears in the regular course schedule for that particular year.\n"
  },
  {
    "title": "COMP 3995 Independent Research  (1-10 Credits)",
    "description": "\n"
  }
]